<a href="https://colab.research.google.com/github/KishorAlagappan/Customer-Conversion-Prediction/blob/main/Customer_Conversion_Prediction_ML_Model.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **Customer Conversion Prediction**

In [17]:
import pandas as pd 
import numpy as np
 
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [58]:
dataset = pd.read_csv('train.csv')  
dataset.head(10)

,age,job,marital,education_qual,call_type,day,mon,dur,num_calls,prev_outcome,y
0,58,management,married,tertiary,unknown,5,may,261,1,unknown,no
1,44,technician,single,secondary,unknown,5,may,151,1,unknown,no
2,33,entrepreneur,married,secondary,unknown,5,may,76,1,unknown,no
3,47,blue-collar,married,unknown,unknown,5,may,92,1,unknown,no
4,33,unknown,single,unknown,unknown,5,may,198,1,unknown,no
5,35,management,married,tertiary,unknown,5,may,139,1,unknown,no
6,28,management,single,tertiary,unknown,5,may,217,1,unknown,no
7,42,entrepreneur,divorced,tertiary,unknown,5,may,380,1,unknown,no
8,58,retired,married,primary,unknown,5,may,50,1,unknown,no
9,43,technician,single,secondary,unknown,5,may,55,1,unknown,no

In [59]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 11 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             45211 non-null  int64
 1   job             45211 non-null  object
 2   marital         45211 non-null  object
 3   education_qual  45211 non-null  object
 4   call_type       45211 non-null  object
 5   day             45211 non-null  int64
 6   mon             45211 non-null  object
 7   dur             45211 non-null  int64
 8   num_calls       45211 non-null  int64
 9   prev_outcome    45211 non-null  object
 10  y               45211 non-null  object
dtypes: int64(4), object(7)
memory usage: 3.8+ MB

In [60]:
dataset.shape

(45211, 11)

In [61]:
dataset.isnull().sum()

age               0
job               0
marital           0
education_qual    0
call_type         0
day               0
mon               0
dur               0
num_calls         0
prev_outcome      0
y                 0
dtype: int64

In [62]:
dataset = dataset.drop_duplicates()

In [63]:
dataset.shape

(45205, 11)

In [64]:
dataset.dtypes

age                int64
job               object
marital           object
education_qual    object
call_type         object
day                int64
mon               object
dur                int64
num_calls          int64
prev_outcome      object
y                 object
dtype: object

In [65]:
dataset.describe()

                age          day           dur     num_calls
count  45205.000000  45205.00000  45205.000000  45205.000000
mean      40.937087     15.80688    258.183055      2.763898
std       10.619130      8.32234    257.538504      3.098189
min       18.000000      1.00000      0.000000      1.000000
25%       33.000000      8.00000    103.000000      1.000000
50%       39.000000     16.00000    180.000000      2.000000
75%       48.000000     21.00000    319.000000      3.000000
max       95.000000     31.00000   4918.000000     63.000000

**Missing Value Analysis**

In [38]:
(dataset['age'].value_counts()).sort_index()

18     12
19     35
20     50
21     79
22    129
     ...
90      2
92      2
93      2
94      1
95      2
Name: age, Length: 77, dtype: int64

In [39]:
dataset['job'].value_counts()

blue-collar      9730
management       9457
technician       7596
admin.           5170
services         4153
retired          2264
self-employed    1579
entrepreneur     1487
unemployed       1303
housemaid        1240
student           938
unknown           288
Name: job, dtype: int64

In [41]:
dataset['job'].replace('unknown', 'blue-collar', inplace = True)

In [43]:
dataset['marital'].value_counts()

married     27210
single      12788
divorced     5207
Name: marital, dtype: int64

In [45]:
dataset['education_qual'].value_counts()

secondary    23199
tertiary     13299
primary       6850
unknown       1857
Name: education_qual, dtype: int64

In [47]:
dataset['education_qual'].replace('unknown', 'secondary', inplace = True)

In [48]:
dataset['call_type'].value_counts()

cellular     29282
unknown      13017
telephone     2906
Name: call_type, dtype: int64

In [50]:
dataset['day'].value_counts().sort_index()

1      322
2     1292
3     1079
4     1445
5     1910
6     1932
7     1817
8     1840
9     1560
10     524
11    1479
12    1603
13    1585
14    1848
15    1703
16    1415
17    1939
18    2308
19    1756
20    2752
21    2026
22     905
23     939
24     447
25     840
26    1035
27    1121
28    1829
29    1745
30    1566
31     643
Name: day, dtype: int64

In [51]:
dataset['mon'].value_counts()

may    13765
jul     6894
aug     6245
jun     5339
nov     3970
apr     2932
feb     2649
jan     1403
oct      738
sep      579
mar      477
dec      214
Name: mon, dtype: int64

In [53]:
dataset['dur'].value_counts().sort_index()

0        3
1        2
2        3
3        4
4       15
        ..
3366     1
3422     1
3785     1
3881     1
4918     1
Name: dur, Length: 1573, dtype: int64

In [55]:
dataset['num_calls'].value_counts().sort_index()

1     17542
2     12503
3      5521
4      3520
5      1764
6      1291
7       735
8       540
9       327
10      266
11      201
12      155
13      133
14       93
15       84
16       79
17       69
18       51
19       44
20       43
21       35
22       23
23       22
24       20
25       22
26       13
27       10
28       16
29       16
30        8
31       12
32        9
33        6
34        5
35        4
36        4
37        2
38        3
39        1
41        2
43        3
44        1
46        1
50        2
51        1
55        1
58        1
63        1
Name: num_calls, dtype: int64

In [56]:
dataset['prev_outcome'].value_counts()

unknown    36953
failure     4901
other       1840
success     1511
Name: prev_outcome, dtype: int64

In [57]:
dataset['y'].value_counts()

no     39916
yes     5289
Name: y, dtype: int64

**EDA - Exploratory Data Analysis**

In [66]:
dataset['target'] = dataset['y'].map({"yes":1, "no":0})